week6/day1/video-games-tournament/app/controllers/api_tournament_controller.rb

	def index
  	tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

	def show
		tournament = Tournament.find_by(id: params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]

	def create
		tournament = Tournament.new(tournament_params)
		unless tournament.save
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "blahblah2"], ["created_at", "2016-05-02 22:43:46.330647"], ["updated_at", "2016-05-02 22:43:46.330647"]]

	def destroy
		tournament = Tournament.find_by(id: params[:id])
		unless tournament
			render json: {error: "tournament not found"}, status: 404
			return
		end

		tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 2]]