week6/day1/video-games-tournament/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
	def index
		players = Player.all

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "player player"], ["created_at", "2016-05-02 23:04:01.259442"], ["updated_at", "2016-05-02 23:04:01.259442"]]
---
	def create
		player = Player.new(player_params)
		unless player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		player = Player.find_by(id: params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
---
	def destroy
		player = Player.find_by(id: params[:id])
		unless player
			render json: {error: "player not found"}, status: 404
			return
		end

		player.destroy